Ответы на вопросы
Задание 2
-Как интерпретировать «10.0.0.0/8 is variably subnetted, 6 subnets, 2 masks»?
На самом деле это не одна сеть, а 6 сетей с 2 разными масками

-Какой тип этого LSA?
Router LSA

-Сколько Router LSA хранится на хранится на R1AR0? Почему именно столько? А сколько Router LSA хранится на других маршрутизаторах этой области?
3, потому что каждый роутер рассылает свой Router LSA

-Кто генерирует Router LSA? Какую информацию содержат Router LSA? В каких пределах распространяются маршрутизаторами Router LSA (в пределах сети, области, автономной системы и т. п.)?
Каждый роутер, содержит описание всех каналов маршрутизатора, стоимость каждого канала, список соседей на каждом интерфейсе (в зоне), распространяются в пределах зоны.

-Какой тип этого LSA?
Network LSA
-Сколько Network LSA хранится на хранится на R1AR0? Почему именно столько? А сколько Network LSA хранится на других маршрутизаторах этой области?
1, потому что его рассылает DR, тоже один
-Что такое Designated Router? Зачем он нужен?
Выделенный роутер, который рассылает Network LSA, он нужен в сетях с множественным доступом, чтобы не загружать сеть множественными рассылками LSA
-Кто генерирует Network LSA? Какую информацию содержат Network LSA? В каких пре-делах распространяются маршрутизаторами Network LSA?
DR, содержит описание всех маршрутизаторов присоединенных к сети, включая DR, в пределах зоны.


-В таблице маршрутизации появились маршруты помеченные кодом «O IA». Что означает этот код?
Сеть из другой зоны OSPF
-Сколько сетей передается из Area 1 в Area 0? Какие? Сколько Summary LSA хранится на R1AR0?
2 зоны, не считая 3 статических, 1 Summary LSA
-Кто и каким образом генерирует Summary LSA? Какую информацию содержат Summary LSA?
Генерирует ABR на основе LSA из обеих зон. Содержит информацию о состоянии каналов сети в соседней области

-В таблице маршрутизации появились записи с кодом «O E2».Что они означают?
Означает, что маршруты получены путем редистрибуции из внешней сети, работающей на другом протоколе
-Объяснить смысл данных выводимых командой show ip ospf database external.
Данные о внешних сетях. Здесь указаны адрес сети, роутер, через который мы можем туда попасть, и прочее.
-Кто и каким образом генерирует External LSA? Какую информацию содержат External LSA?
Генерирует пограничный маршрутизатор автономной системы на основе информации о маршрутах, которая поступает извне. Содержит описание внешних для AS маршрутов или маршруты по умолчанию.


- Что такое тупиковая область? Для чего нужна?
Это область, которая не принимает внешние маршруты, т.е. о внешних маршрутах имеет представление только пограничный роутер. Она нужна, чтобы не перегружать информацией о внешних маршрутах внутренние роутеры.
- Как отразилось на таблице маршрутизации и содержимом топологической базы маршрутизаторов ABR и R1AR1 то, что область стала тупиковой?
ABR продолжает знать все, а второй роутер теперь теряет информацию о внешних маршрутах. Если ему нужно передать информацию за границы автономной системы, он отправит ее на маршрут по умолчанию.
- Предположим, что из области Area 1 понадобилось передать в OSPF какой-то внешний маршрут, например, пробросить статический маршрут до провайдера и т.д. В топологии в Area 1 есть роутер ASBR, на котором настроено несколько статических маршрутов. Удается ли передать эти маршруты в OSPF? Почему?
Нет, для stub зоны это не получится сделать, потому что такая зона не принимает информацию о маршрутах за пределами автономной системы, а пограничный маршрутизатор автономной системы должен их принимать.






!!!Забыл внести логи изменения IP на машрутизаторе R2AR0
Настройка OSPF на роутере R1AR0
R1AR0>enable 
R1AR0#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1AR0(config)#router ospf 1
R1AR0(config-router)#router-id 1.1.1.1
R1AR0(config-router)#network 10.1.1.0 0.0.0.255 area 0
R1AR0(config-router)#network 10.2.2.0 0.0.0.255 area 0
R1AR0(config-router)#exit 
R1AR0(config)#exit 
R1AR0#
%SYS-5-CONFIG_I: Configured from console by console
R1AR0#write memory 
Building configuration...
[OK]
R1AR0#


Настройка OSPF на роутере R2AR0
R2AR0>enable 
R2AR0#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2AR0(config)#router ospf 1
R2AR0(config-router)#router-id 2.2.2.2
R2AR0(config-router)#network 10.2.2.0 0.0.0.255 area 0
R2AR0(config-router)#network 10.10.0.0 0.0.255.255 area 0
R2AR0(config-router)#exit 
R2AR0(config)#exit 
R2AR0#
%SYS-5-CONFIG_I: Configured from console by console
R2AR0#write memory 
Building configuration...
[OK]
R2AR0#


Настройка OSPF на роутере ABR
ABR>enable 
ABR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ABR(config)#router ospf 1
ABR(config-router)#network 10.0.0.0 0.255.255.255 area 0
ABR(config-router)#exit 
ABR(config)#exit 
ABR#
%SYS-5-CONFIG_I: Configured from console by console
ABR#write memory 
Building configuration...
[OK]
ABR#


Настройка OSPF на роутере R1AR1
R1AR1>enable 
R1AR1#CONF T
Enter configuration commands, one per line.  End with CNTL/Z.
R1AR1(config)#router ospf 1
R1AR1(config-router)#network 192.168.0.0 0.0.255.255 area 1
R1AR1(config-router)#exit 
R1AR1(config)#exit 
R1AR1#
%SYS-5-CONFIG_I: Configured from console by console
R1AR1#write memory 
Building configuration...
[OK]
R1AR1#


Настройка OSPF на роутере ASBR
ASBR>enable 
ASBR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ASBR(config)#router ospf 1
ASBR(config-router)#network 192.168.2.0 0.0.0.255 area 1
ASBR(config-router)#exit 
ASBR(config)#exit 
ASBR#
%SYS-5-CONFIG_I: Configured from console by console
ASBR#write memory 
Building configuration...
[OK]
ASBR#


Настройка OSPF на роутере ABR для area 1
ABR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ABR(config)#router ospf 1
ABR(config-router)#network 192.168.1.0 0.0.0.255 area 1
ABR(config-router)#exit 
ABR(config)#exit 
ABR#
%SYS-5-CONFIG_I: Configured from console by console
ABR#write memory 
Building configuration...
[OK]
ABR#


Настройка RIP на роутере RTRRIP
RTRRIP>enable 
RTRRIP#conf t
RTRRIP(config)#interface loopback 0
RTRRIP(config-if)#ip address 172.20.0.1 255.255.255.0
RTRRIP(config-if)#exit 
RTRRIP(config)#interface loopback 1

RTRRIP(config-if)#
%LINK-5-CHANGED: Interface Loopback1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback1, changed state to up

RTRRIP(config-if)#ip address 172.20.1.1 255.255.255.0
RTRRIP(config-if)#exit 
RTRRIP(config)#interface loopback 2

RTRRIP(config-if)#
%LINK-5-CHANGED: Interface Loopback2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback2, changed state to up

RTRRIP(config-if)#ip address 172.20.2.1 255.255.255.0
RTRRIP(config-if)#exit 
RTRRIP(config)#exit 
RTRRIP#
%SYS-5-CONFIG_I: Configured from console by console
RTRRIP#write memory 
Building configuration...
[OK]
RTRRIP#

R1AR0>enable 
R1AR0#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1AR0(config)#router ospf 1
R1AR0(config-router)#redistribute rip subnets 
R1AR0(config-router)#
R1AR0#
%SYS-5-CONFIG_I: Configured from console by console
RTRRIP#write memory 
Building configuration...
[OK]
RTRRIP#


R2AR0#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2AR0(config)#no router rip
R2AR0(config)#router rip
R2AR0(config-router)#version 2
R2AR0(config-router)#redistribute ospf 1 metric 3
R2AR0(config-router)#passive-interface fastEthernet 0/0
R2AR0(config-router)#network 172.20.0.0
R2AR0(config-router)#network 172.20.1.0
R2AR0(config-router)#network 172.20.2.0
R2AR0(config-router)#network 10.3.3.0
R2AR0(config-router)#exit 
R2AR0(config)#exit 
R2AR0#
%SYS-5-CONFIG_I: Configured from console by console
R2AR0#write memory 
Building configuration...
[OK]
R2AR0#ping 10.3.3.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.3.3.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/3 ms

R2AR0#ping 172.20.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.20.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/6 ms
R2AR0#write memory 
Building configuration...
[OK]
R2AR0#



Делаем Area 1 тупиковой (stub)
R1AR1>enable 
R1AR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1AR1(config)#router ospf 1
R1AR1(config-router)#area 1 stub
R1AR1(config-router)#
00:48:37: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.2.2 on Serial2/0 from FULL to DOWN, Neighbor Down: Adjacency forced to reset

00:48:37: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.2.2 on Serial2/0 from FULL to DOWN, Neighbor Down: Interface down or detached

00:48:37: %OSPF-5-ADJCHG: Process 1, Nbr 4.4.4.4 on Serial3/0 from FULL to DOWN, Neighbor Down: Adjacency forced to reset

00:48:37: %OSPF-5-ADJCHG: Process 1, Nbr 4.4.4.4 on Serial3/0 from FULL to DOWN, Neighbor Down: Interface down or detached

R1AR1#
%SYS-5-CONFIG_I: Configured from console by console

R1AR1#write memory 
Building configuration...
[OK]
R1AR1#


Делаем Area 1 не такой уж тупиковой (not so stubby)
ABR>enable 
ABR#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ABR(config)#router ospf 1
ABR(config-router)#area 1 nssa 
ABR(config-router)#exit 
ABR(config)#exit 
ABR#
%SYS-5-CONFIG_I: Configured from console by console
ABR#write memory 
Building configuration...
[OK]
ABR#



